"""
№ 12246 ЕГКР 16.12.23 (Уровень: Базовый)

Определите количество ненулевых цифр в девятеричной записи числа

2⋅729333+2⋅243334−81335+2⋅27336−2⋅9337−3382⋅729333+2⋅243334−81335+2⋅27336−2⋅9337−338
"""


def tencc_to_9cc(number, base):
    output = ''
    while number != 0:
        output += str(number % base)
        number = number // base
    return output[::-1]


number = 2 * 729 ** 333 + 2 * 243 ** 334 - 81 ** 335 + 2 * 27 ** 336 - 2 * 9 ** 337 - 338

number = tencc_to_9cc(number, 9)
print(len(number) - number.count('0'))

# начал делать второе решение, потому что написал 2*243*334 вместо 2*243**334, поэтому обосрался


number = 2 * 729 ** 333 + 2 * 243 ** 334 - 81 ** 335 + 2 * 27 ** 336 - 2 * 9 ** 337 - 338

counter = 0
while number > 0:
    if number % 9 > 0:
        counter += 1
    number //= 9  # делим на нужное основание, т.е. на 9

print(counter)
