"""
№ 10112 (Уровень: Базовый)

(С. Чайкин) В терминологии сетей TCP/IP маской сети называют двоичное число, которое показывает, какая часть IP-адреса узла сети относится к адресу сети, а какая – к адресу узла в этой сети. Адрес сети получается в результате применения поразрядной конъюнкции к заданному  адресу узла и маске сети.

Два узла, находящиеся в одной сети, имеют IP-адреса 92.149.25.164 и 92.149.37.2. Укажите наибольшую возможную сумму байтов маски сети. В ответе укажите только число.
"""