"""
№ 11953 (Уровень: Средний)

(PRO100 ЕГЭ) Исполнитель преобразует число на экране. У исполнителя есть три команды, которые обозначены латинскими буквами:

    A. Прибавить последнюю цифру
    B. Добавить остаток от деления на 68
    C. Возвести в квадрат

Программа для исполнителя – это последовательность команд.

Команда А прибавляет к числу его последнюю цифру. Например, из числа 68 получится число 76.
Команда B прибавляет к числу его остаток от деления на 68. Например, из числа 10 получится число 20.
Команда C возводит число в квадрат. Например, из числа 9 получится число 81.

Если после выполнения команды получается такое же число, то команду нельзя применять к этому числу. Например, к числу 10 нельзя применить команду A, так как 10 + 0 = 10.

Сколько существует программ, для которых при исходном числе 2 результатом является число 680, при этом траектория вычислений содержит число 68 и не содержит числа 100?

Траектория вычислений программы – это последовательность результатов выполнения всех команд программы.
"""


from functools import lru_cache


@lru_cache(None)
def f(a, b):
    if a > b or a == 100: return 0
    if a == b: return 1
    res = 0
    if a % 10 != 0:
        res += f(a + a % 10, b)
    if a % 68 != 0:
        res += f(a + a % 68, b)
    res += f(a * a, b)
    return res


print(f(2, 68) * f(68, 680))

# дожкушка ловушкера. надо проверить, чтобы остаток при делении не равнялся нулю. иначе бесконечный цикл, и никакой lru_cache не поможет