"""
№ 12253 ЕГКР 16.12.23 (Уровень: Базовый)

Исполнитель преобразует число на экране.
У исполнителя есть три команды, которые обозначены латинскими буквами:
А. Прибавить 1
В. Прибавить 3
С. Возвести в квадрат
Программа для исполнителя — это последовательность команд.
Сколько существует программ, для которых при исходном числе 3 результатом является число 26, при этом траектория вычислений содержит число 20 и не содержит числа 16?
Траектория вычислений программы — это последовательность результатов выполнения всех команд программы.
Например, для программы СВА при исходном числе 4 траектория будет состоять из чисел 16, 19, 20.
"""

def f(a, b):
    if a > b or a == 16: return 0
    if a == b: return 1
    return f(a + 1, b) + f(a + 3, b) + f(a * a, b)


print(f(3, 20) * f(20, 26))